Revit 2027 API
GroupTypeId.StructuralAnalysis Property
 Structural Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalysis { get; }
Public Shared ReadOnly Property StructuralAnalysis As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalysis {
	ForgeTypeId^ get ();
}
static member StructuralAnalysis : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace